kslabs/BMI30.stm32h7/USB_DEVICE/App/usb_vendor_app.c
#define VND_SYNC_MODE_MASTER 0u
#define VND_SYNC_MODE_SLAVE  1u
#define VND_SYNC_MODE_OFF    2u
#define VND_STREAM_MODE_LATEST        0u
#define VND_STREAM_MODE_LOSSLESS_ROI  1u
#define VND_STREAM_MODE_AVG_ROI       2u
#define VND_AVG_MAX_N                 64u  /* Максимум 64 буфера для усреднения (шаг 8: 8/16/24/32/40/48/56/64) */
#define VND_AVG_OUT_Q                 4u
#define VND_HOST_RX_ACK_TIMEOUT_MS    1500u

/* Параметры */
#define VND_DEFAULT_TEST_SAMPLES   80u
#define VND_DEBUG_FORCE_STAT_INTERVAL_MS 200u // было 100
#define VND_DEBUG_RAW_STAT_INTERVAL_MS   100u

/* ---------------- Глобальные переменные состояния (централизовано) ---------------- */
/* Видимая снаружи (CDC) метка стриминга */
volatile uint8_t streaming = 0;
static volatile uint8_t vnd_tx_enable = 0; /* 1=передатчик включён (PA1=0), 0=выкл (PA1=1); по умолчанию выключен */
/* Последовательность пар (инкремент только после успешного завершения B) */
volatile uint32_t stream_seq = 0;
/* Фактически зафиксированный размер кадров и ожидаемый размер байт */
volatile uint16_t cur_samples_per_frame = 0;
volatile uint16_t cur_expected_frame_size = 0;
/* Служебные отметки старта/ошибок */
volatile uint32_t start_cmd_ms = 0;
volatile uint32_t vnd_last_error = 0;
/* Отложенный (main-loop) перезапуск ADC/DMA по команде START.
    Важно: USBD_VND_DataReceived может вызываться из USB IRQ, поэтому тяжёлые действия
    (останов/запуск DMA, cache maintenance) выполняем в Vendor_Stream_Task(). */
static volatile uint8_t vnd_adc_restart_request = 0;
/* Флаги канала передачи */
static volatile uint8_t  vnd_ep_busy = 0;     /* EP IN занят */
static volatile uint8_t  vnd_inflight = 0;    /* есть незавершённая передача */
/* Тестовый кадр (разрешён один раз на START, для keepalive) */
static volatile uint8_t  test_sent = 0;
static volatile uint8_t  test_in_flight = 0;
/* Отладочные счётчики/статусы */
volatile uint32_t dbg_produced_seq = 0;
volatile uint32_t dbg_sent_seq_adc0 = 0;
volatile uint32_t dbg_sent_seq_adc1 = 0;
volatile uint32_t dbg_partial_frame_abort = 0;
volatile uint32_t dbg_size_mismatch = 0;
volatile uint32_t dbg_resend_blocked = 0;
/* (Определения vnd_diag_prepare_pair и vnd_diag_try_tx перенесены ниже, после объявлений типов/буферов) */
static volatile uint32_t dbg_tx_attempt = 0;
static volatile uint32_t dbg_tx_reject = 0;
static volatile uint32_t dbg_tx_sent = 0;
static volatile uint32_t dbg_status_sent = 0;
volatile uint32_t dbg_sent_ch0_total = 0; // новые счётчики по каналам
volatile uint32_t dbg_sent_ch1_total = 0;
/* Глобальный счётчик завершений передачи (используется в статусе и диагностике) */
volatile uint32_t dbg_tx_cplt = 0;
/* Следующая метка последовательности для назначения готовящимся парам (может опережать stream_seq,
   который инкрементируется только по завершении B). */
static volatile uint32_t next_seq_to_assign = 0;

/* Добавлено: счётчик ошибок и отметка последнего TXCPLT */
static volatile uint32_t vnd_error_counter = 0;      /* ++ при BUSY/REJECT */
static volatile uint32_t vnd_last_txcplt_ms = 0;      /* время последнего успешного завершения передачи */
static volatile uint32_t vnd_last_frame_txcplt_ms = 0; /* время последнего успешного завершения рабочего кадра A/B */
static volatile uint32_t vnd_last_host_rx_ack_ms = 0;  /* время последнего подтверждения чтения потока от хоста */
static volatile uint32_t vnd_host_rx_last_counter = 0; /* последний принятый счётчик host-received frames */
static volatile uint8_t  vnd_host_rx_counter_valid = 0;
/* Счётчик переданных семплов (оба канала суммарно) */
static volatile uint64_t vnd_total_tx_samples = 0ULL;
/* Новые маркеры состояния запуска потока */

/* Режим смягчения команды DEVICE_RESET: вместо NVIC_SystemReset выполнить мягкое USB восстановление
    через флаг need_recovery, если включено. Это предотвращает полное исчезновение устройства с шины
    при частых запросах 0x22 и снижает влияние на отладку. */
#ifndef VND_DEVICE_RESET_SOFT_ONLY
/* ВРЕМЕННО: разрешаем полный аппаратный reset по команде 0x22 (через флаг need_hard_reset в main) */
#define VND_DEVICE_RESET_SOFT_ONLY 0
#endif

/* Флаг восстановления (определён в main.c) */
extern volatile uint8_t need_recovery;
static volatile uint8_t  vnd_pending_init = 0;  /* 1 после START пока нет ни одного кадра A/B */
static volatile uint8_t  vnd_stream_active = 0; /* 1 после первой успешной передачи A или B */
/* Init-pump диагностика */
static volatile uint32_t init_pump_attempts = 0;    /* сколько циклов быстрой попытки отправки первой A */
static volatile uint32_t init_pump_a_sent  = 0;     /* 1+ если хотя бы одна A ушла через init-pump */

/* Временные метки/диагностика */
static volatile uint32_t first_test_sent_ms = 0;
static uint32_t dma_snapshot_full0 = 0;
static uint32_t dma_snapshot_full1 = 0;
static uint8_t no_dma_status_sent = 0;
static uint32_t dbg_last_forced_stat_ms = 0;
static uint8_t dbg_printed_sizes = 0;
static uint8_t dbg_any_valid_frame = 0;

/* Хостовые параметры для вывода на LCD */
static uint8_t host_profile = 0; /* последний профиль, присланный хостом (как есть) */

/* ДИАГНОСТИКА: отслеживание последней принятой команды START/STOP */
static volatile uint8_t  last_cmd_received = 0;     /* 0x20=START, 0x21=STOP, 0=none */
static volatile uint32_t last_cmd_timestamp_ms = 0; /* HAL_GetTick() когда команда получена */
static volatile uint32_t cmd_start_count = 0;       /* счётчик принятых START */
static volatile uint32_t cmd_stop_count = 0;        /* счётчик принятых STOP */

/* Sync master/slave via TIM16 CH1 */
static volatile uint8_t  vnd_sync_mode = VND_SYNC_MODE_SLAVE; /* 0=master, 1=slave, 2=off */
static volatile uint16_t vnd_sync_pending_hz = 0;
static volatile uint16_t vnd_sync_last_hz = 0;
static volatile uint32_t vnd_sync_last_apply_ms = 0;
static volatile uint32_t vnd_sync_last_capture = 0;
static volatile uint8_t  vnd_sync_capture_valid = 0;
static volatile uint32_t vnd_sync_tick_hz = 1000000u; /* TIM16 IC tick (Hz) */
static volatile uint32_t vnd_sync_last_capture_ms = 0;

