kslabs/BMI30.stm32h7/USB_DEVICE/App/usb_vendor_app.c
/* Time-based DC adaptation. Host-visible units are milliseconds; host UI can show seconds.
    Значения трактуются как время выхода примерно на 99% к целевому уровню 32767:
    larger value means slower tracking. */
#ifndef VND_DC_WORK_SETTLE_MS
#define VND_DC_WORK_SETTLE_MS   (15u*60u*1000u) /* 900 s */
#endif
#ifndef VND_DC_DETECT_SETTLE_MS
#define VND_DC_DETECT_SETTLE_MS (60u*1000u)     /* 60 s */
#endif
#ifndef VND_DC_FAST_SETTLE_MS
#define VND_DC_FAST_SETTLE_MS   (5u*1000u)      /* 5 s */
#endif
#ifndef VND_DC_FAST_DURATION_MS
#define VND_DC_FAST_DURATION_MS (30u*1000u)     /* 30 s after reboot */
#endif
#ifndef VND_DC_SETTLE_MIN_MS
#define VND_DC_SETTLE_MIN_MS    (1000u)
#endif
#ifndef VND_DC_SETTLE_MAX_MS
#define VND_DC_SETTLE_MAX_MS    (24u*60u*60u*1000u)
#endif
#ifndef VND_DC_FAST_DURATION_MAX_MS
#define VND_DC_FAST_DURATION_MAX_MS (60u*60u*1000u)
#endif
#ifndef VND_DC_ADAPT_DT_MAX_MS
#define VND_DC_ADAPT_DT_MAX_MS  (1000u)
#endif

/* ln(100) в формате Q16: нужен, чтобы settle_ms означал время выхода на ~99%.
    Если alpha = dt / settle, то за settle устройство доходит только до ~63%,
    что не соответствует ожидаемой пользователем семантике. */
#ifndef VND_DC_SETTLE_99_LN100_Q16
#define VND_DC_SETTLE_99_LN100_Q16 301804u
#endif

#ifndef VND_DC_FAST_ALPHA_MIN_Q16
/* В BOOT_FAST держим минимум 10% от текущей ошибки за одно обновление.
    Шаг остаётся динамическим, потому что сама коррекция пропорциональна err[i]. */
#define VND_DC_FAST_ALPHA_MIN_Q16 6554u
#endif

/* Быстрая поиндексная (per-sample) подстройка DC.
    Важно: DC хранится как 4 массива по 200 значений (канал×чет/нечет), и корректировка
    должна быть по каждому семплу, а не только одним числом.
    Эти параметры задают «скорость» поиндексной адаптации и ограничение шага. */
#ifndef VND_DC_SAMPLE_GAIN_DIV
/* Поиндексная адаптация: шаг ~= err/div. Меньше div -> быстрее.
    Важно: это НЕ «общий» шаг для всего окна, а индивидуально для каждого i. */
#define VND_DC_SAMPLE_GAIN_DIV (256)
#endif
#ifndef VND_DC_SAMPLE_STEP_MAX
/* Скорость по просьбе: шаг адаптации ±1 на один вызов. */
#define VND_DC_SAMPLE_STEP_MAX (1)
#endif

/* Deadband для адаптации DC вокруг midscale.
    Без deadband даже при правильном DC из-за шума знак (v-32767) будет часто меняться,
    что приводит к "random walk" (постоянно dirty и ощущение, что после reboot всё заново).
    Значение в LSB. */
#ifndef VND_DC_DEADBAND
#define VND_DC_DEADBAND 16u
#endif

/* ВНИМАНИЕ: адрес Flash должен быть вне области прошивки.
   Мы резервируем последний сектор через линкер (см. STM32H723VGTX_FLASH.ld).
   Для 1MB FLASH: база последнего сектора = 0x080E0000 (128KB сектор №7). */
#ifndef VND_DC_FLASH_ADDR
#define VND_DC_FLASH_ADDR 0x080E0000u
#endif

#define VND_DC_MAGIC 0x31434456u /* 'V''D''C''1' little-endian */
/* ver=3: commit marker in _pad[] makes partially written slots uncommitted. */
#define VND_DC_VER   3u

typedef struct __attribute__((packed)) {
    uint32_t magic;
    uint16_t ver;
    uint16_t roi_len; /* ожидаем 200 */
    uint32_t write_counter;
    uint16_t crc16; /* CRC16-CCITT по полю data[] */
    uint16_t _rsv0;

    int16_t  dc[2][2][VND_DC_ROI_LEN]; /* [ch][parity][i] signed offset */
    uint8_t  pos[2][2];
    uint8_t  _pad[32]; /* запас/выравнивание; точный размер не критичен */
} vnd_dc_blob_t;

/* Flash layout: append-only journal inside the reserved 128KB sector.
   This avoids long sector erase on every save (which can stall USB/main loop).
   We erase the sector only when it becomes full or journal tail is corrupted.
   Slot size must be multiple of 32 bytes for FLASHWORD programming. */
#define VND_DC_FLASH_SECTOR_SIZE (0x20000u)
#define VND_DC_SLOT_SIZE         (((uint32_t)sizeof(vnd_dc_blob_t) + 31u) & ~31u)
#define VND_DC_COMMIT_MAGIC      0x21434456u /* 'VDC!' little-endian */
#define VND_DC_COMMIT_OFFSET     ((uint32_t)offsetof(vnd_dc_blob_t, _pad) + 28u)
#define VND_DC_RECOVERY_MAGIC    0x44524356u /* 'VCRD' little-endian */

static int16_t  vnd_dc_buf[2][2][VND_DC_ROI_LEN];
static uint8_t  vnd_dc_pos[2][2];
static uint8_t  vnd_dc_loaded = 0;
static uint8_t  vnd_dc_dirty = 0;
static uint32_t vnd_dc_write_counter = 0;
static uint32_t vnd_dc_flash_next_off = 0;
static uint32_t vnd_dc_last_save_ms = 0;
static uint32_t vnd_dc_last_dirty_log_ms = 0;
static volatile uint8_t vnd_dc_load_request = 0;
static int32_t  vnd_dc_accum_q16[2][2][VND_DC_ROI_LEN];
static uint8_t  vnd_dc_accum_valid = 0;
static uint32_t vnd_dc_last_adapt_ms[2][2];

static volatile uint8_t  vnd_dc_mode = VND_DC_MODE_BOOT_FAST;
/* Режим, в который возвращаемся после FREEZE по команде SET_DC_ADAPT=1. */
static volatile uint8_t  vnd_dc_resume_mode = VND_DC_MODE_BOOT_FAST;
static volatile uint32_t vnd_dc_work_settle_ms = (uint32_t)VND_DC_WORK_SETTLE_MS;
static volatile uint32_t vnd_dc_detect_settle_ms = (uint32_t)VND_DC_DETECT_SETTLE_MS;
static volatile uint32_t vnd_dc_fast_settle_ms = (uint32_t)VND_DC_FAST_SETTLE_MS;
static volatile uint32_t vnd_dc_fast_duration_ms = (uint32_t)VND_DC_FAST_DURATION_MS;
static volatile uint32_t vnd_dc_mode_enter_ms = 0;
static volatile uint32_t vnd_dc_fast_until_ms = (uint32_t)VND_DC_FAST_DURATION_MS;
static volatile uint32_t vnd_dc_adapt_updates = 0;

/* После reboot "чет/нечет" (parity) может оказаться инвертирован относительно того, что было
    во время обучения/сохранения (из-за фазировки старта DMA/TIM).
    Мы НЕ смешиваем 4 DC массива, а один раз на старте определяем swap (0/1) и дальше
    используем parity^swap при применении/адаптации. */
static uint8_t vnd_dc_parity_swap = 0;
static uint8_t vnd_dc_parity_swap_valid = 0;

static void vnd_dc_load_once(void);
static void vnd_dc_apply_and_adapt(uint8_t ch, uint8_t parity, uint16_t *out, uint16_t roi_len, uint8_t gate_enabled);
static void vnd_dc_set_mode(uint8_t mode);
static uint8_t vnd_dc_effective_mode(uint32_t now_ms);
static uint32_t vnd_dc_active_settle_ms(uint32_t now_ms);

/* Exported counters for LCD/diagnostics (see usb_vendor_app.h) */
volatile uint32_t vnd_dc_save_ok_count = 0;
volatile uint32_t vnd_dc_save_fail_count = 0;
volatile uint32_t vnd_dc_save_last_ms = 0;
volatile uint8_t  vnd_dc_save_last_result = 0; /* 0=none, 1=ok, 2=fail */

