kslabs/BMI30.stm32h7/USB_DEVICE/App/usb_vendor_app.c
/* DC Adaptation control (can be frozen by host during signal detection) */
volatile uint8_t  vnd_dc_adapt_enabled = 1; /* 1=active (learning), 0=freeze (keep current values) */

/* Auto-freeze when signal swing is too large for safe DC learning. */
volatile uint8_t  vnd_dc_auto_freeze = 0; /* 1=auto-freeze by amplitude gate */

/* Public mirror of blob write_counter for LCD/debug (see usb_vendor_app.h) */
volatile uint32_t vnd_dc_write_counter_public = 0;

/* Exported live state for LCD progress indicator */
volatile uint8_t  vnd_dc_dirty_public = 0;
volatile uint32_t vnd_dc_dirty_since_ms = 0;
volatile uint32_t vnd_dc_save_period_ms = (uint32_t)VND_DC_SAVE_PERIOD_MS;

/* DC save diagnostics */
volatile uint32_t vnd_dc_save_last_err = 0;
volatile uint32_t vnd_dc_save_last_sector_error = 0;
volatile uint32_t vnd_dc_save_last_bank = 0;
volatile uint32_t vnd_dc_save_last_sector = 0;

/* DC load diagnostics (published for LCD) */
volatile uint8_t  vnd_dc_load_flags_public = 0; /* bit0=loaded OK, bit1=erase_pending */
volatile uint16_t vnd_dc_loaded_crc16_public = 0;
volatile uint32_t vnd_dc_flash_next_off_public = 0;

static uint32_t vnd_dc_adapt_block_until_ms = 0;

static uint32_t vnd_dc_clamp_settle_ms(uint32_t value_ms)
{
    if(value_ms < (uint32_t)VND_DC_SETTLE_MIN_MS) return (uint32_t)VND_DC_SETTLE_MIN_MS;
    if(value_ms > (uint32_t)VND_DC_SETTLE_MAX_MS) return (uint32_t)VND_DC_SETTLE_MAX_MS;
    return value_ms;
}

static uint32_t vnd_dc_clamp_fast_duration_ms(uint32_t value_ms)
{
    if(value_ms > (uint32_t)VND_DC_FAST_DURATION_MAX_MS) return (uint32_t)VND_DC_FAST_DURATION_MAX_MS;
    return value_ms;
}

static uint32_t vnd_dc_legacy_fast_rate_hz(void)
{
    uint32_t rate = adc_stream_get_buf_rate();
    if(rate == 0u) rate = 50u;

    if(vnd_stream_mode == VND_STREAM_MODE_AVG_ROI){
        uint32_t avg_n = (uint32_t)vnd_avg_n;
        uint32_t denom;
        if(avg_n == 0u) avg_n = 1u;
        denom = avg_n * 2u;
        rate = (rate + denom - 1u) / denom;
        if(rate == 0u) rate = 1u;
    }

    return rate;
}

static void vnd_dc_reset_adapt_timestamps(void)
{
    memset(vnd_dc_last_adapt_ms, 0, sizeof(vnd_dc_last_adapt_ms));
}

static void vnd_dc_sync_accum_from_buf(void)
{
    for(uint8_t ch = 0; ch < 2u; ch++){
        for(uint8_t p = 0; p < 2u; p++){
            for(uint16_t i = 0; i < (uint16_t)VND_DC_ROI_LEN; i++){
                vnd_dc_accum_q16[ch][p][i] = (int32_t)((int64_t)vnd_dc_buf[ch][p][i] * 65536LL);
            }
        }
    }
    vnd_dc_accum_valid = 1u;
    vnd_dc_reset_adapt_timestamps();
}

static int16_t vnd_dc_q16_to_i16(int32_t q16)
{
    int64_t q = (int64_t)q16;
    int32_t v;
    if(q >= 0){
        v = (int32_t)((q + 32768LL) / 65536LL);
    } else {
        v = (int32_t)(-(((-q) + 32768LL) / 65536LL));
    }
    if(v < -32768) v = -32768;
    else if(v > 32767) v = 32767;
    return (int16_t)v;
}

static void vnd_dc_set_mode(uint8_t mode)
{
    if(mode > VND_DC_MODE_BOOT_FAST) mode = VND_DC_MODE_WORK;
    uint32_t now_ms = HAL_GetTick();
    if(mode != VND_DC_MODE_FREEZE){
        vnd_dc_resume_mode = mode;
    }
    vnd_dc_mode = mode;
    vnd_dc_mode_enter_ms = now_ms;
    if(mode == VND_DC_MODE_BOOT_FAST && vnd_dc_fast_duration_ms != 0u){
        vnd_dc_fast_until_ms = now_ms + vnd_dc_fast_duration_ms;
    } else {
        vnd_dc_fast_until_ms = 0u;
    }
    vnd_dc_adapt_enabled = (mode == VND_DC_MODE_FREEZE) ? 0u : 1u;
    vnd_dc_reset_adapt_timestamps();
}

static uint8_t vnd_dc_effective_mode(uint32_t now_ms)
{
    uint8_t mode = vnd_dc_mode;
    if(mode == VND_DC_MODE_BOOT_FAST){
        uint32_t dur = vnd_dc_fast_duration_ms;
        if(dur == 0u || (uint32_t)(now_ms - vnd_dc_mode_enter_ms) >= dur){
            mode = VND_DC_MODE_WORK;
            vnd_dc_mode = mode;
            vnd_dc_mode_enter_ms = now_ms;
            vnd_dc_fast_until_ms = 0u;
            vnd_dc_fast_frames = 0u; /* legacy indicator */
            vnd_dc_reset_adapt_timestamps();
        } else {
            vnd_dc_fast_until_ms = vnd_dc_mode_enter_ms + dur;
        }
    }
    vnd_dc_adapt_enabled = (mode == VND_DC_MODE_FREEZE) ? 0u : 1u;
    return mode;
}

static uint32_t vnd_dc_active_settle_ms(uint32_t now_ms)
{
    uint8_t mode = vnd_dc_effective_mode(now_ms);
    if(mode == VND_DC_MODE_FREEZE) return 0u;
    if(mode == VND_DC_MODE_DETECT) return vnd_dc_detect_settle_ms;
    if(mode == VND_DC_MODE_BOOT_FAST) return vnd_dc_fast_settle_ms;
    return vnd_dc_work_settle_ms;
}

static uint32_t vnd_dc_rd_le32(const uint8_t *p)
{
    return (uint32_t)p[0] |
           ((uint32_t)p[1] << 8) |
           ((uint32_t)p[2] << 16) |
           ((uint32_t)p[3] << 24);
}

static void vnd_dc_apply_config_payload(const uint8_t *payload, uint32_t payload_len)
{
    if(payload == NULL || payload_len < 2u) return;
    if(payload[0] != 1u) return; /* version */

    uint8_t mode = payload[1];
    if(payload_len >= 20u){
        uint16_t flags = (uint16_t)(payload[2] | ((uint16_t)payload[3] << 8));
        (void)flags; /* reserved for future host-side policy */

        uint32_t work_ms = vnd_dc_rd_le32(payload + 4);
        uint32_t detect_ms = vnd_dc_rd_le32(payload + 8);
        uint32_t fast_ms = vnd_dc_rd_le32(payload + 12);
        uint32_t fast_duration_ms = vnd_dc_rd_le32(payload + 16);

        vnd_dc_work_settle_ms = vnd_dc_clamp_settle_ms(work_ms);
        vnd_dc_detect_settle_ms = vnd_dc_clamp_settle_ms(detect_ms);
        vnd_dc_fast_settle_ms = vnd_dc_clamp_settle_ms(fast_ms);
        vnd_dc_fast_duration_ms = vnd_dc_clamp_fast_duration_ms(fast_duration_ms);
    }

    vnd_dc_set_mode(mode);
}

typedef struct {
    uint32_t magic;
    uint32_t magic_inv;
    uint32_t fault_addr;
    uint32_t cfsr;
    uint32_t count;
} vnd_dc_recovery_t;

static volatile vnd_dc_recovery_t __attribute__((section(".noinit"))) vnd_dc_recovery;

static uint8_t vnd_dc_flash_addr_in_range(uint32_t addr)
{
    return (uint8_t)((addr >= (uint32_t)VND_DC_FLASH_ADDR) &&
                     (addr < ((uint32_t)VND_DC_FLASH_ADDR + (uint32_t)VND_DC_FLASH_SECTOR_SIZE)));
}

void vnd_dc_note_flash_fault(uint32_t fault_addr, uint32_t cfsr)
{
    if(!vnd_dc_flash_addr_in_range(fault_addr)) return;

