kslabs/BMI30.stm32h7/USB_DEVICE/App/usb_vendor_app.c
        if(now_freeze){
            if(!prev_freeze){
                freeze_start_ms = now_ms;
            }
        } else {
            if(prev_freeze && freeze_start_ms != 0u){
                if(vnd_dc_dirty_since_ms != 0u){
                    uint32_t delta = now_ms - freeze_start_ms;
                    vnd_dc_dirty_since_ms += delta; /* pause progress timer during freeze */
                }
                freeze_start_ms = 0u;
            }
        }
        prev_freeze = now_freeze;
        vnd_dc_auto_freeze = now_freeze;
    }

    /* Use local copy of ROI so we don't mutate ADC buffers. */
    static uint16_t tmp_a[VND_DC_ROI_LEN];
    static uint16_t tmp_b[VND_DC_ROI_LEN];
    memcpy(tmp_a, a_ptr + roi_start, (size_t)roi_len * sizeof(uint16_t));
    memcpy(tmp_b, b_ptr + roi_start, (size_t)roi_len * sizeof(uint16_t));

    /* Диагностика согласования с GUI: раз в секунду печатаем min/max/mean по ROI
       до и после применения DC (для тех же данных). */
    static uint32_t last_stats_ms = 0;
    uint8_t do_stats = 0u;
    if(last_stats_ms == 0u || (now_ms - last_stats_ms) >= 1000u){
        last_stats_ms = now_ms;
        do_stats = 1u;
    }
    uint16_t raw_mn_a = 0xFFFFu, raw_mx_a = 0u;
    uint16_t raw_mn_b = 0xFFFFu, raw_mx_b = 0u;
    __attribute__((unused)) int32_t raw_mean_a = 0;
    __attribute__((unused)) int32_t raw_mean_b = 0;
    if(do_stats){
        int64_t sum_a = 0;
        int64_t sum_b = 0;
        for(uint16_t i = 0; i < roi_len; i++){
            uint16_t va = tmp_a[i];
            uint16_t vb = tmp_b[i];
            if(va < raw_mn_a) raw_mn_a = va;
            if(va > raw_mx_a) raw_mx_a = va;
            if(vb < raw_mn_b) raw_mn_b = vb;
            if(vb > raw_mx_b) raw_mx_b = vb;
            sum_a += (int32_t)va;
            sum_b += (int32_t)vb;
        }
        raw_mean_a = (int32_t)(sum_a / (int32_t)roi_len);
        raw_mean_b = (int32_t)(sum_b / (int32_t)roi_len);
    }

    /* Ensure persisted DC is loaded before first adapt. */
    vnd_dc_load_once();

    /* Один раз после загрузки определяем, не инвертирован ли parity. */
    if(!vnd_dc_parity_swap_valid){
        uint32_t s0 = 0, s1 = 0;
        /* swap=0: используем parity как есть */
        s0 += vnd_dc_score_bank(a_ptr, ns, roi_start, roi_len, 0u, parity);
        s0 += vnd_dc_score_bank(b_ptr, ns, roi_start, roi_len, 1u, parity);
        /* swap=1: используем инвертированный parity */
        s1 += vnd_dc_score_bank(a_ptr, ns, roi_start, roi_len, 0u, (uint8_t)(parity ^ 1u));
        s1 += vnd_dc_score_bank(b_ptr, ns, roi_start, roi_len, 1u, (uint8_t)(parity ^ 1u));

        if(s1 < s0){
            vnd_dc_parity_swap = 1u;
        } else {
            vnd_dc_parity_swap = 0u;
        }
        vnd_dc_parity_swap_valid = 1u;
        VND_DC_LOGF("[DC] PARITY_SWAP=%u (raw_parity=%u s0=%lu s1=%lu)\r\n",
               (unsigned)vnd_dc_parity_swap, (unsigned)parity,
               (unsigned long)s0, (unsigned long)s1);

        /* Одноразовая проверка, что применяемый банк действительно центрирует ROI. */
        {
            uint8_t p_use = (uint8_t)(parity ^ vnd_dc_parity_swap);
            uint8_t p_alt = (uint8_t)(p_use ^ 1u);

            int64_t raw_sum_a = 0, raw_sum_b = 0;
            for(uint16_t i = 0; i < roi_len; i++){
                raw_sum_a += (int32_t)a_ptr[roi_start + i];
                raw_sum_b += (int32_t)b_ptr[roi_start + i];
            }
            __attribute__((unused)) int32_t raw_mean_a = (int32_t)(raw_sum_a / (int32_t)roi_len);
            __attribute__((unused)) int32_t raw_mean_b = (int32_t)(raw_sum_b / (int32_t)roi_len);

            /* check for chosen bank */
            int64_t sum_a = 0, sum_b = 0;
            uint32_t err_a = 0, err_b = 0;
            for(uint16_t i = 0; i < roi_len; i++){
                int32_t ya = (int32_t)a_ptr[roi_start + i] + (int32_t)vnd_dc_buf[0][p_use][i];
                int32_t yb = (int32_t)b_ptr[roi_start + i] + (int32_t)vnd_dc_buf[1][p_use][i];
                sum_a += ya;
                sum_b += yb;
                int32_t ea = ya - 32767; if(ea < 0) ea = -ea;
                int32_t eb = yb - 32767; if(eb < 0) eb = -eb;
                err_a += (uint32_t)ea;
                err_b += (uint32_t)eb;
            }
            __attribute__((unused)) int32_t mean_a = (int32_t)(sum_a / (int32_t)roi_len);
            __attribute__((unused)) int32_t mean_b = (int32_t)(sum_b / (int32_t)roi_len);

            /* check for alternative bank (flip parity bank) */
            int64_t sum2_a = 0, sum2_b = 0;
            uint32_t err2_a = 0, err2_b = 0;
            for(uint16_t i = 0; i < roi_len; i++){
                int32_t ya = (int32_t)a_ptr[roi_start + i] + (int32_t)vnd_dc_buf[0][p_alt][i];
                int32_t yb = (int32_t)b_ptr[roi_start + i] + (int32_t)vnd_dc_buf[1][p_alt][i];
                sum2_a += ya;
                sum2_b += yb;
                int32_t ea = ya - 32767; if(ea < 0) ea = -ea;
                int32_t eb = yb - 32767; if(eb < 0) eb = -eb;
                err2_a += (uint32_t)ea;
                err2_b += (uint32_t)eb;
            }
            __attribute__((unused)) int32_t mean2_a = (int32_t)(sum2_a / (int32_t)roi_len);
            __attribute__((unused)) int32_t mean2_b = (int32_t)(sum2_b / (int32_t)roi_len);

                 VND_DC_LOGF("[DC] APPLY_CHECK: roi=%u+%u raw_meanA=%ld raw_meanB=%ld p=%u meanA=%ld meanB=%ld errA=%lu errB=%lu alt_p=%u alt_meanA=%ld alt_meanB=%ld alt_errA=%lu alt_errB=%lu\r\n",
                   (unsigned)roi_start, (unsigned)roi_len,
                   (long)raw_mean_a, (long)raw_mean_b,
                   (unsigned)p_use,
                   (long)mean_a, (long)mean_b,
                   (unsigned long)err_a, (unsigned long)err_b,
                   (unsigned)p_alt,
                   (long)mean2_a, (long)mean2_b,
                   (unsigned long)err2_a, (unsigned long)err2_b);
        }
    }

    vnd_dc_apply_and_adapt(0, parity, tmp_a, roi_len, gate_a);
    vnd_dc_apply_and_adapt(1, parity, tmp_b, roi_len, gate_b);

    if(do_stats && vnd_dc_parity_swap_valid){
        __attribute__((unused)) uint8_t p_use = (uint8_t)(parity ^ vnd_dc_parity_swap);

        uint16_t mn_a = 0xFFFFu, mx_a = 0u;
        uint16_t mn_b = 0xFFFFu, mx_b = 0u;
        int64_t sum_a = 0;
        int64_t sum_b = 0;
        for(uint16_t i = 0; i < roi_len; i++){
            uint16_t va = tmp_a[i];
            uint16_t vb = tmp_b[i];
            if(va < mn_a) mn_a = va;
            if(va > mx_a) mx_a = va;
            if(vb < mn_b) mn_b = vb;
            if(vb > mx_b) mx_b = vb;
            sum_a += (int32_t)va;
            sum_b += (int32_t)vb;
        }
        __attribute__((unused)) int32_t mean_a = (int32_t)(sum_a / (int32_t)roi_len);
        __attribute__((unused)) int32_t mean_b = (int32_t)(sum_b / (int32_t)roi_len);

        VND_DC_LOGF("[DC] ROI_STATS: roi=%u+%u raw_p=%u swap=%u p=%u gateA=%u gateB=%u "
               "A_raw(mn=%u mx=%u mean=%ld) A_dc(mn=%u mx=%u mean=%ld) "
               "B_raw(mn=%u mx=%u mean=%ld) B_dc(mn=%u mx=%u mean=%ld)\r\n",
               (unsigned)roi_start, (unsigned)roi_len,
               (unsigned)parity, (unsigned)vnd_dc_parity_swap, (unsigned)p_use,
               (unsigned)gate_a, (unsigned)gate_b,
               (unsigned)raw_mn_a, (unsigned)raw_mx_a, (long)raw_mean_a,
               (unsigned)mn_a, (unsigned)mx_a, (long)mean_a,
               (unsigned)raw_mn_b, (unsigned)raw_mx_b, (long)raw_mean_b,
               (unsigned)mn_b, (unsigned)mx_b, (long)mean_b);
    }
}

