kslabs/BMI30.stm32h7/USB_DEVICE/App/usb_vendor_app.c
    /* Программирование flashword: 32 bytes */
    const uint8_t *src = (const uint8_t*)&blob;
    uint32_t addr = (uint32_t)VND_DC_FLASH_ADDR + write_off;
    uint32_t remaining = (uint32_t)sizeof(blob);
    uint8_t ok = 1;
    while(remaining){
        uint32_t chunk = remaining;
        if(chunk > 32u) chunk = 32u;
        uint32_t fw32[8] __attribute__((aligned(32)));
        for(uint8_t i=0;i<8;i++) fw32[i] = 0xFFFFFFFFu;
        memcpy((uint8_t*)fw32, src, chunk);
        if(HAL_FLASH_Program(FLASH_TYPEPROGRAM_FLASHWORD, addr, (uint32_t)(uintptr_t)fw32) != HAL_OK){
            ok = 0;
            break;
        }
        addr += 32u;
        src  += chunk;
        remaining -= chunk;
    }
    HAL_FLASH_Lock();

    /* NOTE: no read-back verify here to avoid extra Flash reads and any DCache coherency pitfalls.
       We treat HAL_OK for all program operations as success. */

    if(ok){
        vnd_dc_dirty = 0;
        vnd_dc_dirty_public = 0;
        vnd_dc_dirty_since_ms = 0;
        vnd_dc_last_save_ms = now;
        vnd_dc_save_ok_count++;
        vnd_dc_save_last_result = 1;
        vnd_dc_save_last_ms = now;
        vnd_dc_flash_next_off = write_off + VND_DC_SLOT_SIZE;
        vnd_dc_flash_next_off_public = vnd_dc_flash_next_off;
        vnd_dc_load_flags_public = 1u; /* after a successful write, journal state is sane */
        vnd_dc_loaded_crc16_public = blob.crc16;
        VND_DC_LOGF("[DC] SAVE OK: bank=%lu sector=%lu addr=0x%08lX cnt=%lu\r\n",
               (unsigned long)erase_bank, (unsigned long)erase_sector,
               (unsigned long)(uint32_t)(VND_DC_FLASH_ADDR + write_off), (unsigned long)vnd_dc_write_counter);
    } else {
        uint32_t err = 0;
#if defined(HAL_FLASH_GetError)
        err = HAL_FLASH_GetError();
#endif
        vnd_dc_save_last_err = err;
        vnd_dc_save_fail_count++;
        vnd_dc_save_last_result = 2;
        vnd_dc_save_last_ms = now;
        VND_DC_LOGF("[DC] SAVE FAIL: prog bank=%lu sector=%lu err=0x%08lX\r\n",
               (unsigned long)erase_bank, (unsigned long)erase_sector, (unsigned long)err);
        /* Не сбрасываем dirty. Перезапускаем отсчёт до следующей попытки. */
        vnd_dc_dirty_since_ms = now;
    }
}

/* === DSP (AVG_ROI): свёртка/корреляции на 200 усреднённых сэмплах ===
   Важно: не модифицируем данные потока, только считаем метрики и профилируем время.
   - Свёртка (как "матч-фильтр") здесь представлена как dot(x, x) / энергии и dot(even, odd).
   - Корреляция между even/odd (внутри канала) и между каналами (A/B) на одинаковой parity.
*/
typedef struct {
    uint8_t have[2][2]; /* [ch][parity] */
    uint16_t last[2][2][MAX_FRAME_SAMPLES];
    uint16_t roi_len;

    float corr_eo[2]; /* corr(even, odd) per channel */
    float corr_ab[2]; /* corr(A,B) for parity: [0]=even, [1]=odd */

    uint32_t dsp_us_total;
    uint32_t dsp_us_cnt;
    uint32_t dsp_us_max;
} vnd_dsp_stats_t;

static vnd_dsp_stats_t vnd_dsp = {0};

static inline void vnd_dwt_init_once(void)
{
    static uint8_t inited = 0;
    if(inited) return;
    inited = 1;
    CoreDebug->DEMCR |= CoreDebug_DEMCR_TRCENA_Msk;
    DWT->CYCCNT = 0;
    DWT->CTRL |= DWT_CTRL_CYCCNTENA_Msk;
}

static inline uint32_t vnd_dwt_cycles(void)
{
    return DWT->CYCCNT;
}

static inline uint32_t vnd_cycles_to_us(uint32_t cycles)
{
    uint32_t hz = SystemCoreClock;
    if(hz == 0u) hz = 1u;
    return (uint32_t)(((uint64_t)cycles * 1000000ull) / (uint64_t)hz);
}

static float vnd_corr_norm_u16(const uint16_t *x, const uint16_t *y, uint16_t n)
{
    if(n == 0u) return 0.0f;
    uint64_t sx = 0, sy = 0;
    for(uint16_t i=0;i<n;i++){ sx += x[i]; sy += y[i]; }
    float mx = (float)sx / (float)n;
    float my = (float)sy / (float)n;

    double num = 0.0;
    double ex = 0.0;
    double ey = 0.0;
    for(uint16_t i=0;i<n;i++){
        double dx = (double)x[i] - (double)mx;
        double dy = (double)y[i] - (double)my;
        num += dx * dy;
        ex  += dx * dx;
        ey  += dy * dy;
    }
    double den = sqrt(ex * ey);
    if(den <= 1e-12) return 0.0f;
    return (float)(num / den);
}

static void vnd_dsp_update(uint8_t parity, const uint16_t out_ch0[MAX_FRAME_SAMPLES], const uint16_t out_ch1[MAX_FRAME_SAMPLES], uint16_t roi_len)
{
    if(roi_len == 0u) return;
    if(roi_len > MAX_FRAME_SAMPLES) roi_len = MAX_FRAME_SAMPLES;

    vnd_dsp.roi_len = roi_len;
    for(uint16_t i=0;i<roi_len;i++){
        vnd_dsp.last[0][parity][i] = out_ch0[i];
        vnd_dsp.last[1][parity][i] = out_ch1[i];
    }
    vnd_dsp.have[0][parity] = 1;
    vnd_dsp.have[1][parity] = 1;

    /* Корреляция even/odd внутри каждого канала, когда есть обе parity */
    for(uint8_t ch=0; ch<2; ch++){
        if(vnd_dsp.have[ch][0] && vnd_dsp.have[ch][1]){
            vnd_dsp.corr_eo[ch] = vnd_corr_norm_u16(vnd_dsp.last[ch][0], vnd_dsp.last[ch][1], roi_len);
        }
    }
    /* Корреляция между каналами на текущей parity */
    if(vnd_dsp.have[0][parity] && vnd_dsp.have[1][parity]){
        vnd_dsp.corr_ab[parity] = vnd_corr_norm_u16(vnd_dsp.last[0][parity], vnd_dsp.last[1][parity], roi_len);
    }
}

/* Очередь готовых усреднённых ROI кадров (mode=2) */
static uint8_t vnd_avg_q_head = 0, vnd_avg_q_tail = 0, vnd_avg_q_count = 0;
static uint16_t vnd_avg_q_out[VND_AVG_OUT_Q][2][MAX_FRAME_SAMPLES];
static uint32_t vnd_avg_q_dma_seq[VND_AVG_OUT_Q];
static uint32_t vnd_avg_q_ts_ms[VND_AVG_OUT_Q];
static uint8_t vnd_avg_q_bufidx[VND_AVG_OUT_Q]; /* 0..7, где bit0 = parity (even/odd) */
static uint8_t vnd_avg_gui_ctr = 0; /* 0,2,4,6 — для формирования 0..7 с parity битом */

static void vnd_avg_drain_fifo(uint16_t roi_start, uint16_t roi_len);

static void vnd_avg_reset(void)
{
    vnd_avg_cnt[0] = 0; vnd_avg_cnt[1] = 0;
    vnd_avg_next_parity = 0;
    vnd_avg_last_dma_seq[0] = 0; vnd_avg_last_dma_seq[1] = 0;
    vnd_avg_last_ts_ms[0] = 0; vnd_avg_last_ts_ms[1] = 0;
    vnd_avg_q_head = 0; vnd_avg_q_tail = 0; vnd_avg_q_count = 0;
    vnd_avg_gui_ctr = 0;
    dbg_avg_in_frames = 0;
    dbg_avg_out_frames = 0;
    dbg_avg_tx_pairs = 0;
    dbg_avg_last_print_ms = 0;
    dbg_avg_in_last = 0; dbg_avg_out_last = 0; dbg_avg_tx_last = 0;
    memset(&vnd_dsp, 0, sizeof(vnd_dsp));
    /* суммы обнулять не требуется: мы заново инициализируем по vnd_avg_cnt==0 */
}

static void vnd_avg_drain_fifo(uint16_t roi_start, uint16_t roi_len)
{
    if(vnd_stream_mode != VND_STREAM_MODE_AVG_ROI) return;
    if(!streaming) return;
    if(roi_len == 0u) return;
    if(roi_len > VND_MAX_SAMPLES) roi_len = VND_MAX_SAMPLES;
    if(roi_len > MAX_FRAME_SAMPLES) roi_len = MAX_FRAME_SAMPLES;

    uint8_t avg_n = vnd_avg_n;
    if(avg_n < 1) avg_n = 1;
    if(avg_n > VND_AVG_MAX_N) avg_n = VND_AVG_MAX_N;

    /* Ограничим работу за один проход, чтобы не забивать main-loop */
    for(uint8_t iter = 0; iter < 16u; ++iter)
    {
        if(vnd_avg_q_count >= VND_AVG_OUT_Q) break;

        uint16_t *a_ptr = NULL, *b_ptr = NULL; uint16_t ns = 0; uint32_t dma_seq = 0;
        if(!adc_peek_frame_pair_fifo(&a_ptr, &b_ptr, &ns, &dma_seq)){
            break; /* нет новых кадров */
        }
        if(ns < (uint16_t)(roi_start + roi_len)){
            (void)adc_consume_frame_pair_fifo(dma_seq);
            continue; /* кадр не подходит под окно */
        }
        dbg_avg_in_frames++;

        uint8_t parity = (uint8_t)(adc_get_buffer_parity(dma_seq) & 1u);
        if(vnd_avg_cnt[parity] == 0){
            for(uint16_t i=0;i<roi_len;i++){
                vnd_avg_sum[parity][0][i] = 0;
                vnd_avg_sum[parity][1][i] = 0;
            }
        }
        uint16_t *a_roi = a_ptr + roi_start;
        uint16_t *b_roi = b_ptr + roi_start;
        for(uint16_t i=0;i<roi_len;i++){
            vnd_avg_sum[parity][0][i] += (uint32_t)a_roi[i];
            vnd_avg_sum[parity][1][i] += (uint32_t)b_roi[i];
        }
        vnd_avg_cnt[parity]++;
        vnd_avg_last_dma_seq[parity] = dma_seq;
        vnd_avg_last_ts_ms[parity] = HAL_GetTick();
        (void)adc_consume_frame_pair_fifo(dma_seq);

        /* Группа готова: выпускаем усреднённый кадр РОВНО после получения avg_n кадров этой parity.
           Важно: не используем vnd_avg_next_parity для условия выпуска, иначе при «прогреве»
           оба счётчика могут стать >= avg_n и кадры начнут выпускаться почти с входной частотой.
           Каждый входной кадр должен попасть ровно в одну группу (по своей parity). */
        if(vnd_avg_cnt[parity] >= avg_n)
        {
            uint8_t out_parity = parity;
            uint8_t q = vnd_avg_q_tail;
            uint8_t avg_gate_a = 0u;
            uint8_t avg_gate_b = 0u;
            for(uint16_t i=0;i<roi_len;i++){
                vnd_avg_q_out[q][0][i] = (uint16_t)((vnd_avg_sum[out_parity][0][i] + (uint32_t)(avg_n/2u)) / (uint32_t)avg_n);
                vnd_avg_q_out[q][1][i] = (uint16_t)((vnd_avg_sum[out_parity][1][i] + (uint32_t)(avg_n/2u)) / (uint32_t)avg_n);
            }

            if(vnd_dc_effective_mode(HAL_GetTick()) == VND_DC_MODE_BOOT_FAST){
                avg_gate_a = (uint8_t)(vnd_raw_has_full_swing_u16(vnd_avg_q_out[q][0], roi_len, (uint32_t)VND_DC_RANGE_THRESHOLD) ? 0u : 1u);
                avg_gate_b = (uint8_t)(vnd_raw_has_full_swing_u16(vnd_avg_q_out[q][1], roi_len, (uint32_t)VND_DC_RANGE_THRESHOLD) ? 0u : 1u);
            }

