kslabs/BMI30.stm32h7/USB_DEVICE/App/usb_vendor_app.c
                /* DC (только для roi_len=200): применяем вычитание всегда.
                    В BOOT_FAST дополнительно разрешаем обучение по усреднённым кадрам,
                    чтобы быстрая адаптация mode 5 работала по реальному GUI-потоку. */
            vnd_dc_load_once();
                vnd_dc_apply_and_adapt(0, out_parity, vnd_avg_q_out[q][0], roi_len, avg_gate_a);
                vnd_dc_apply_and_adapt(1, out_parity, vnd_avg_q_out[q][1], roi_len, avg_gate_b);

            /* DSP (корреляции/профилирование) — на готовом усреднённом ROI */
            vnd_dwt_init_once();
            uint32_t c0 = vnd_dwt_cycles();
            vnd_dsp_update(out_parity, vnd_avg_q_out[q][0], vnd_avg_q_out[q][1], roi_len);
            uint32_t c1 = vnd_dwt_cycles();
            uint32_t dus = vnd_cycles_to_us(c1 - c0);
            vnd_dsp.dsp_us_total += dus;
            vnd_dsp.dsp_us_cnt++;
            if(dus > vnd_dsp.dsp_us_max) vnd_dsp.dsp_us_max = dus;

            vnd_avg_q_dma_seq[q] = vnd_avg_last_dma_seq[out_parity];
            vnd_avg_q_ts_ms[q] = vnd_avg_last_ts_ms[out_parity];
                /* ВАЖНО: parity/индекс для GUI должны быть стабильны.
                    Нельзя вычислять parity позже по dma_seq, потому что s_buffer_parity[] — кольцевой буфер.
                    Поэтому сохраняем метку 0..7 прямо в очереди. */
                vnd_avg_q_bufidx[q] = (uint8_t)((vnd_avg_gui_ctr & 0x06u) | (out_parity & 1u));
                vnd_avg_gui_ctr = (uint8_t)((vnd_avg_gui_ctr + 2u) & 0x06u);

            vnd_avg_q_tail = (uint8_t)((vnd_avg_q_tail + 1u) % VND_AVG_OUT_Q);
            vnd_avg_q_count++;

            dbg_avg_out_frames++;

            vnd_avg_cnt[out_parity] = 0;
        }
    }
}



/* === FPS измерение === */
static uint32_t fps_pair_count = 0;       /* Кол-во завершённых пар с момента старта измерения */
static uint32_t fps_frame_a_count = 0;    /* Кол-во отправленных A-кадров */
static uint32_t fps_frame_b_count = 0;    /* Кол-во отправленных B-кадров */
static uint32_t fps_prepare_count = 0;    /* Кол-во вызовов vnd_prepare_pair */
static uint32_t fps_measurement_start_ms = 0; /* Время начала измерения */
static uint32_t fps_last_report_ms = 0;   /* Время последнего отчёта */

/* === Профилирование производительности === */
typedef struct {
    uint32_t prepare_total_us;    /* Суммарное время подготовки пар (мкс) */
    uint32_t prepare_count;       /* Кол-во вызовов prepare */
    uint32_t transmit_total_us;   /* Суммарное время transmit (мкс) */
    uint32_t transmit_count;      /* Кол-во вызовов transmit */
    uint32_t txcplt_total_us;     /* Суммарное время TxCplt (мкс) */
    uint32_t txcplt_count;        /* Кол-во вызовов TxCplt */
    uint32_t last_pair_complete_ms; /* Время последнего завершения пары */
    uint32_t min_pair_interval_ms;  /* Минимальный интервал между парами */
    uint32_t max_pair_interval_ms;  /* Максимальный интервал между парами */
} perf_stats_t;

static perf_stats_t perf_stats = {0};

/* Вспомогательная функция для получения времени в микросекундах (используем HAL_GetTick с умножением) */
static inline uint32_t get_us_approx(void) {
    /* Приблизительно: 1 мс = 1000 мкс. Для более точного измерения нужен DWT, 
       но HAL_GetTick безопаснее и достаточно точен для наших целей */
    static uint32_t last_tick = 0;
    static uint32_t us_offset = 0;
    uint32_t tick = HAL_GetTick();
    if(tick != last_tick){
        us_offset = 0;
        last_tick = tick;
    }
    return tick * 1000 + us_offset++;
}

/* Инвалидация D-Cache для DMA-буфера (копия функции из adc_stream.c) */
static inline void vnd_invalidate_cache_for_buffer(void *buf, uint32_t samples)
{
#if (VND_ENABLE_CACHE_INVALIDATE && defined (SCB_InvalidateDCache_by_Addr))
    uintptr_t addr = (uintptr_t)buf;
    uintptr_t start = addr & ~(uintptr_t)31u; /* выравнивание вниз до 32 байт */
    uint32_t bytes = samples * (uint32_t)sizeof(uint16_t);
    uint32_t extra = (uint32_t)(addr - start);
    uint32_t total = bytes + extra;
    uint32_t total_aligned = (total + 31u) & ~31u; /* кратность 32 */
    SCB_InvalidateDCache_by_Addr((uint32_t*)start, (int32_t)total_aligned);
#else
    (void)buf; (void)samples;
#endif
}

/* Быстрый санитайзер: заменяет явно повреждённые (>12 бит) значения последним валидным */
static __attribute__((unused)) uint32_t vnd_sanitize_samples(uint16_t *buf, uint16_t samples, const char *tag)
{
    uint32_t fixed = 0;
    uint16_t prev = 0;
    uint8_t have_prev = 0;
    uint16_t first_bad = 0, first_idx = 0;
    for(uint16_t i = 0; i < samples; ++i){
        uint16_t v = buf[i];
        if(v > 4095u){
            if(fixed == 0){ first_bad = v; first_idx = i; }
            buf[i] = have_prev ? prev : 0;
            fixed++;
        } else {
            prev = v; have_prev = 1;
        }
    }
    if(fixed){
        static uint32_t last_log_ms = 0;
        uint32_t now = HAL_GetTick();
        if(now - last_log_ms >= 1000u){
            last_log_ms = now;
            printf("[VND_SAN] %s fixed=%lu first_idx=%u first_bad=%u prev=%u\r\n",
                   tag, (unsigned long)fixed, (unsigned)first_idx, (unsigned)first_bad, (unsigned)(have_prev ? prev : 0));
        }
    }
    return fixed;
}
/* Подсчёт выбросов >4095 (опционально, если включить санитайзер) */
static volatile uint32_t dbg_gt4095_ch[2] = {0,0};
#ifndef VND_ENABLE_ADC_SANITIZE
#define VND_ENABLE_ADC_SANITIZE 0 /* по умолчанию не трогаем данные ADC */
#endif

#ifndef VND_SPIKE_CLIP_ENABLE
#define VND_SPIKE_CLIP_ENABLE 0 /* теперь не клипуем, только детектируем */
#endif
#ifndef VND_SPIKE_THRESHOLD
#define VND_SPIKE_THRESHOLD 3000u
#endif
#ifndef VND_SPIKE_MIN_LEN
#define VND_SPIKE_MIN_LEN 6u
#endif

/* Детектор/клиппер блоков высокой амплитуды (короткие пачки ≈10 семплов) */
static __attribute__((unused)) uint32_t vnd_detect_and_clip_spikes(uint16_t *buf, uint16_t samples, const char *tag)
{
    if(!buf || samples == 0) return 0;
    uint32_t events = 0;
    uint16_t thr = VND_SPIKE_THRESHOLD;
    uint16_t last_good = 0;
    uint8_t have_last = 0;
    static uint32_t last_log_ms = 0;
    for(uint16_t i=0; i<samples; ){
        uint16_t v = buf[i];
        if(v <= thr){
            last_good = v; have_last = 1; i++; continue;
        }
        /* найден старт блока выше порога */
        uint16_t start = i;
        uint16_t maxv = v;
        while(i < samples && buf[i] > thr){
            if(buf[i] > maxv) maxv = buf[i];
            i++;
        }
        uint16_t len = (uint16_t)(i - start);
        if(len >= VND_SPIKE_MIN_LEN){
            events++;
            /* опционально клипуем весь блок на последнее валидное значение */
            if(VND_SPIKE_CLIP_ENABLE){
                uint16_t fill = have_last ? last_good : 0;
                for(uint16_t k=start; k<start+len && k<samples; ++k){ buf[k] = fill; }
            }
            uint32_t now = HAL_GetTick();
            if(now - last_log_ms >= 500u){
                last_log_ms = now;
                printf("[VND_SPIKE] %s idx=%u len=%u max=%u thr=%u clip=%u\r\n",
                       tag, (unsigned)start, (unsigned)len, (unsigned)maxv,
                       (unsigned)thr, (unsigned)VND_SPIKE_CLIP_ENABLE);
            }
        }
    }
    return events;
}

