kslabs/BMI30.stm32h7/USB_DEVICE/App/usb_vendor_app.c
    fps_last_report_ms = now_ms;
}

/* === Функция вывода детального профилирования по запросу === */
void vnd_print_perf_stats(void)
{
    uint32_t now_ms = HAL_GetTick();
    uint32_t elapsed_ms = now_ms - fps_measurement_start_ms;
    float elapsed_sec = (elapsed_ms > 0) ? ((float)elapsed_ms / 1000.0f) : 0.001f;
    
    /* FPS */
    float pair_fps = (float)fps_pair_count / elapsed_sec;
    float frame_a_fps = (float)fps_frame_a_count / elapsed_sec;
    float frame_b_fps = (float)fps_frame_b_count / elapsed_sec;
    
    /* Средние времена */
    uint32_t avg_prepare_us = (perf_stats.prepare_count > 0) ? 
        (perf_stats.prepare_total_us / perf_stats.prepare_count) : 0;
    uint32_t avg_transmit_us = (perf_stats.transmit_count > 0) ?
        (perf_stats.transmit_total_us / perf_stats.transmit_count) : 0;
    uint32_t avg_txcplt_us = (perf_stats.txcplt_count > 0) ?
        (perf_stats.txcplt_total_us / perf_stats.txcplt_count) : 0;
    
    cdc_logf("=== PERFORMANCE STATS (%.1fs) ===", elapsed_sec);
    cdc_logf("FPS: pairs=%.1f A=%.1f B=%.1f", pair_fps, frame_a_fps, frame_b_fps);
    cdc_logf("COUNTS: pairs=%lu A=%lu B=%lu prep=%lu",
        (unsigned long)fps_pair_count, (unsigned long)fps_frame_a_count,
        (unsigned long)fps_frame_b_count, (unsigned long)fps_prepare_count);
    cdc_logf("TIMING: prepare=%luus tx=%luus txcplt=%luus",
        (unsigned long)avg_prepare_us, (unsigned long)avg_transmit_us,
        (unsigned long)avg_txcplt_us);
    cdc_logf("INTERVAL: min=%lums max=%lums",
        (unsigned long)perf_stats.min_pair_interval_ms,
        (unsigned long)perf_stats.max_pair_interval_ms);
    
    /* Диагностика ADC */
    extern volatile uint32_t frame_wr_seq, frame_rd_seq;
    cdc_logf("ADC: wr=%lu rd=%lu skipped=%lu",
        (unsigned long)frame_wr_seq, (unsigned long)frame_rd_seq,
        (unsigned long)dbg_skipped_frames);
}

/* Отправка отложенного STAT только из таска */
static void vnd_try_send_pending_status_from_task(void)
{
    /* В диагностическом режиме полностью запрещаем любые STAT по bulk-IN,
       чтобы исключить окна между A и B. Для статуса используйте EP0 (ctrl).
       Также ACK-STOP в DIAG не отправляем через bulk (см. обработчик STOP). */
    if(diag_mode_active){ return; }
    if(!pending_status) return;
    /* Нельзя отправлять STAT, если есть незавершённая передача (даже если busy временно сброшен) */
    if(vnd_ep_busy || vnd_inflight) return;
    uint16_t l = vnd_build_status((uint8_t*)status_buf, sizeof(status_buf));
        if(!l) { pending_status = 0; return; } /* (очистка дублирующего кода STAT уже выполнена выше) */
    vnd_status_permit_once = 1;
    vnd_tx_ready = 0; vnd_ep_busy = 1; vnd_last_tx_len = l; vnd_last_tx_start_ms = HAL_GetTick();
    if(USBD_VND_Transmit(&hUsbDeviceHS, (uint8_t*)status_buf, l) == USBD_OK){
        vnd_tx_meta_after((uint8_t*)status_buf, l);
        VND_LOG("STAT_TX pending(task) len=%u depth=%u", l, (unsigned)vnd_tx_meta_depth());
        if(stop_request){ stop_stat_inflight = 1; }
        pending_status = 0;
    } else {
        VND_LOG("STAT_TX pending(task) busy/fail");
        vnd_tx_ready = 1; vnd_ep_busy = 0;
    }
}

/* Тик от таймера */
static volatile uint8_t vnd_tick_flag = 0;
void usb_vendor_periodic_tick(void){ vnd_tick_flag = 1; }

void vnd_request_adc_restart_from_isr(void)
{
    vnd_adc_restart_request = 1u;
}

/*
 * ВАЖНО:
 * - В on-wire протоколе поле hdr.seq должно отражать логическую последовательность кадра,
 *   привязанную к данным DMA (а не к счётчику отправок).
 * - Хостовый GUI использует (seq & 1) как even/odd, поэтому seq НЕ должен быть пер-канальным
 *   счётчиком передачи.
 */

/* ---------------- Вспомогательные ---------------- */
static void vnd_reset_buffers(void){
    for(uint8_t p=0;p<VND_PAIR_BUFFERS;p++) for(uint8_t c=0;c<2;c++){ g_frames[p][c].st=FB_FILL; g_frames[p][c].samples=0; g_frames[p][c].flags = c?VND_FLAGS_ADC1:VND_FLAGS_ADC0; g_frames[p][c].frame_size=0; g_frames[p][c].seq=0; g_frames[p][c].dma_seq=0; g_frames[p][c].crc16=0; g_frames[p][c].crc_seq=0; memset(g_frames[p][c].buf,0xCC,sizeof(g_frames[p][c].buf)); }
    pair_fill_idx=pair_send_idx=0; sending_channel=0xFF; channel0_sent_curseq=channel1_sent_curseq=0; pending_B = 0; pending_B_since_ms = 0;
}

uint16_t vnd_build_status(uint8_t *dst, uint16_t max_len){
    if(max_len < 64) return 0; /* требуется минимум v1 */
    memset(&g_status,0,sizeof(g_status));
    /* Сигнатура 'STAT' в первых 4 байтах */
    g_status.sig[0] = 'S';
    g_status.sig[1] = 'T';
    g_status.sig[2] = 'A';
    g_status.sig[3] = 'T';
    g_status.version = 5; /* v5: adds RPI optic hold, sync status bytes, LED pattern */
    g_status.cur_samples = cur_samples_per_frame;
    g_status.frame_bytes = (uint16_t)(VND_FRAME_HDR_SIZE + cur_samples_per_frame*2u);
    g_status.test_frames = test_sent ? 1u : 0u;
    g_status.produced_seq = dbg_produced_seq;
    g_status.sent0 = dbg_sent_ch0_total;
    g_status.sent1 = dbg_sent_ch1_total;
    g_status.dbg_tx_cplt = dbg_tx_cplt;
    g_status.dbg_partial_frame_abort = dbg_partial_frame_abort;
    g_status.dbg_size_mismatch = dbg_size_mismatch;
    /* Получим DMA счётчики */
    adc_stream_debug_t d; adc_stream_get_debug(&d);
    g_status.dma_done0 = d.dma_full0;
    g_status.dma_done1 = d.dma_full1;
    g_status.frame_wr_seq = d.frame_wr_seq;
    /* Дополнение: сохранить независимые seq по каналам в резервных полях для отладки (LSW) */
    /* Используем zone_count/zone1_offset временно, НЕ нарушая сигнатуру first 4 bytes (для старого парсера останутся нулями, если не читает эти поля) */
    /* Предполагается, что хост обновит парсер позже; сейчас это поле диагностическое. */
    /* ВНИМАНИЕ: если host строго ожидает zone_count==0, можно отключить. */
    /* Здесь пока не трогаем формат кадра; STAT расширяем безопасно. */
    if(streaming) g_status.flags_runtime |= VND_STFLAG_STREAMING;
    if(diag_mode_active) g_status.flags_runtime |= VND_STFLAG_DIAG_ACTIVE;
    if(vnd_pending_init) g_status.flags_runtime |= VND_STFLAG_PENDING_INIT;
    if(vnd_stream_active) g_status.flags_runtime |= VND_STFLAG_STREAM_ACTIVE;
    if(vnd_tx_enable) g_status.flags_runtime |= VND_STFLAG_TX_ENABLED;
    if(optic_sensor_get_state()) g_status.flags_runtime |= VND_STFLAG_OPTIC_ACTIVE;
    /* Новые поля диагностики */
    uint16_t f2 = 0;
    /* Бит0 = занятость IN EP: локальная (vnd_ep_busy) ИЛИ низкоуровневая (LL vnd_tx_busy) */
    {
        extern uint8_t USBD_VND_TxIsBusy(void);
        uint8_t ll_busy = USBD_VND_TxIsBusy();
        if(vnd_ep_busy || ll_busy) f2 |= 1u<<0;
    }
    if(vnd_tx_ready)         f2 |= 1u<<1;
    if(pending_B)            f2 |= 1u<<2;
    if(test_in_flight)       f2 |= 1u<<3;
    if(start_ack_done)       f2 |= 1u<<4;
    if(start_stat_inflight)  f2 |= 1u<<5;
    if(start_stat_planned)   f2 |= 1u<<6;
    if(pending_status)       f2 |= 1u<<7;
    if(simple_tx_mode)       f2 |= 1u<<8;
    if(diag_mode_active)     f2 |= 1u<<9;
    if(first_pair_done)      f2 |= 1u<<10; /* переместим ниже биты READY/SENDING */
    /* Доп. диагностика: наличие готовых кадров в g_frames[0] */
    {
        uint8_t st_slot = vnd_get_active_stream_slot(pending_B ? 1u : 0u);
        ChanFrame *fa = &g_frames[st_slot][0];
        ChanFrame *fb = &g_frames[st_slot][1];
        if (fa->st == FB_READY) f2 |= 1u<<11;
        if (fb->st == FB_READY) f2 |= 1u<<12;
        /* Новые биты: состояние SENDING для A/B чтобы различать READY и активную передачу */
        if (fa->st == FB_SENDING) f2 |= 1u<<13;
        if (fb->st == FB_SENDING) f2 |= 1u<<14;
    }
    g_status.flags2 = f2;
    g_status.sending_ch = sending_channel;
    g_status.pair_idx = (uint16_t)(((uint16_t)pair_fill_idx << 8) | pair_send_idx);
    g_status.last_tx_len = vnd_last_tx_len;
    g_status.cur_stream_seq = stream_seq;
     /* Переиспользуем резервные поля для отладки на хосте (совместимо с parser'ом):
        reserved0 = LSB dbg_prepare_calls, reserved2(low) = LSB dbg_prepare_ok,
        reserved3 = LSW frame_rd_seq (для сравнения с frame_wr_seq). */
     /* Упаковываем в reserved0: нижние 4 бита = LSB dbg_prepare_calls, старшие 4 = lastTxRC (LL) */
     do {
         extern uint8_t USBD_VND_LastTxRC(void);
         uint8_t rc = USBD_VND_LastTxRC();
         uint8_t lsb = (uint8_t)(dbg_prepare_calls & 0x0Fu);
         g_status.reserved0 = (uint8_t)((rc << 4) | lsb);
     } while(0);
      /* reserved2 переупаковка:
          низшие 4 бита = LSB dbg_prepare_ok,
          старшие 4 бита = (init_pump_attempts & 0x0F) (диагностика старта).
          Факт отправки A через pump отражаем также в flags2 бит15. */
      uint8_t prep_lsb = (uint8_t)(dbg_prepare_ok & 0x0Fu);
      uint8_t pump_att = (uint8_t)(init_pump_attempts & 0x0Fu);
      g_status.reserved2 = (uint8_t)((pump_att << 4) | prep_lsb);
    /* Оптическая телеметрия для RPI (legacy 64B view):
       reserved3[15:8] = optic_power (0..255),
       reserved3[7:2]  = optic_hold_seconds rounded up (1..63),
       reserved3[1]    = tx_enable,
       reserved3[0]    = optic_active. */
    do {
        uint8_t optic_power = optic_tx_get_power();
        uint8_t optic_hold_seconds = optic_sensor_get_hold_seconds();
        uint8_t optic_bits = (uint8_t)((optic_hold_seconds & 0x3Fu) << 2);
        if (optic_sensor_get_state()) {
            optic_bits |= 0x01u;
        }
        if (vnd_tx_enable) {
            optic_bits |= 0x02u;
        }
        g_status.reserved3 = (uint16_t)(((uint16_t)optic_power << 8) | optic_bits);
    } while (0);
    /* Отразим факт успешной отправки A через init-pump в flags2 бит15 ("A_fill READY" ранее не использовался) */
    if(init_pump_a_sent){ g_status.flags2 |= (uint16_t)(1u<<15); }
    /* v2 расширение: заполняем метки стадий (если доступны) */
    g_status.stage_alt1_ms = vnd_stage_alt1_ms;
    g_status.stage_start_ms = start_cmd_ms;
    g_status.stage_first_frame_ms = vnd_stage_first_frame_ms;
    
