kslabs/BMI30.stm32h7/USB_DEVICE/App/usb_vendor_app.c
    /* v3 расширение: ДИАГНОСТИКА счётчиков нулевых буферов ADC */
    g_status.ch_zero_buffers_A = d.ch_zero_buffers[0];
    g_status.ch_zero_buffers_B = d.ch_zero_buffers[1];
    /* v4 расширение: текущий tick и метки последнего полного DMA кадра по каналам */
    do {
        uint32_t now_ms = HAL_GetTick();
        extern volatile uint32_t adc_last_full0_ms;
        extern volatile uint32_t adc_last_full1_ms;
        g_status.now_ms = now_ms;
        g_status.last_full0_ms = adc_last_full0_ms;
        g_status.last_full1_ms = adc_last_full1_ms;
        if (streaming &&
            (vnd_last_host_rx_ack_ms != 0u) &&
            ((uint32_t)(now_ms - vnd_last_host_rx_ack_ms) <= VND_HOST_RX_ACK_TIMEOUT_MS)) {
            g_status.flags_runtime |= VND_STFLAG_HOST_RX_ALIVE;
        }
    } while(0);
    /* v5 extension: RPI-facing sync and dynamic LED state */
    do {
        g_status.optic_hold_ds = optic_sensor_get_hold_deciseconds();
        g_status.led_pattern = dynamic_led_get_pattern();
        (void)rs485_status_get_snapshot(&g_status.sync_local_status,
                                        &g_status.sync_node_count,
                                        &g_status.sync_seen_mask,
                                        g_status.sync_status_bytes,
                                        (uint8_t)sizeof(g_status.sync_status_bytes));
    } while(0);
     /* Хак: инкремент dbg_skipped_frames отображаем в sent0/sent1 дельтах, но здесь добавим только
        косвенную диагностику: если skips растут, host увидит разницу produced_seq - sent*. Дополнительно
        можно временно печатать в CDC при отладке (сейчас лог выключен для скорости). */
    /* Output length is schema-aligned for old hosts: 64B(v1), 96B(v4), or 136B(v5). */
    if(max_len < 96u){
        g_status.version = 1;
        memcpy(dst, &g_status, 64);
        return 64;
    }
    if(max_len < sizeof(vnd_status_v1_t)){
        g_status.version = 4;
        memcpy(dst, &g_status, 96);
        return 96;
    }
    memcpy(dst,&g_status,sizeof(g_status));
    return (uint16_t)sizeof(g_status);
}

uint16_t vnd_build_lcd_status(uint8_t *dst, uint16_t max_len)
{
    vnd_lcd_status_v1_t st;
    vnd_lcd_sync_snapshot_t snap;

    if ((dst == NULL) || (max_len < (uint16_t)sizeof(st))) {
        return 0u;
    }

    memset(&st, 0, sizeof(st));
    memset(&snap, 0, sizeof(snap));
    vnd_get_lcd_sync_snapshot(&snap);

    st.sig[0] = 'L';
    st.sig[1] = 'C';
    st.sig[2] = 'D';
    st.sig[3] = 'S';
    st.version = 1u;
    st.raw_mode = snap.raw_mode;
    st.display_mode = snap.display_mode;
    st.display_value = snap.display_value;
    st.slave_count = snap.slave_count;
    st.node_id = snap.node_id;
    st.display_color_id = snap.display_color_id;
    st.display_char = snap.display_char;
    st.display_rgb565 = snap.display_rgb565;
    st.sync_age_ms = snap.sync_age_ms;

    if (snap.sync_signal_alive != 0u) {
        st.flags |= VND_LCD_SYNC_FLAG_SIGNAL_ALIVE;
    }
    if (snap.sync_ok_visual != 0u) {
        st.flags |= VND_LCD_SYNC_FLAG_SYNC_OK_VISUAL;
    }
    if (snap.sync_color_locked != 0u) {
        st.flags |= VND_LCD_SYNC_FLAG_COLOR_LOCKED;
    }
    if (snap.sync_signal_alive == 0u) {
        st.flags |= VND_LCD_SYNC_FLAG_DISPLAY_FALLBACK;
    }
    if (vnd_sync_is_mode_host_forced() != 0u) {
        st.flags |= VND_LCD_SYNC_FLAG_HOST_FORCED;
    }

    st.text[0] = (char)st.display_char;
    if (st.display_mode == VND_SYNC_MODE_OFF) {
        st.text[1] = ' ';
        st.text[2] = ' ';
    } else {
        st.text[1] = (char)('0' + ((st.display_value / 10u) % 10u));
        st.text[2] = (char)('0' + (st.display_value % 10u));
    }
    st.text[3] = '\0';

    memcpy(dst, &st, sizeof(st));
    return (uint16_t)sizeof(st);
}

uint16_t vnd_build_dc_config(uint8_t *dst, uint16_t max_len)
{
    vnd_dc_config_v1_t st;
    if ((dst == NULL) || (max_len < (uint16_t)sizeof(st))) {
        return 0u;
    }

    uint32_t now_ms = HAL_GetTick();
    uint8_t mode = vnd_dc_effective_mode(now_ms);
    uint32_t active_settle_ms = vnd_dc_active_settle_ms(now_ms);

    memset(&st, 0, sizeof(st));
    st.sig[0] = 'D';
    st.sig[1] = 'C';
    st.sig[2] = 'C';
    st.sig[3] = 'F';
    st.version = 1u;
    st.mode = mode;
    if(vnd_dc_adapt_enabled) st.flags |= VND_DC_CFG_FLAG_ADAPT_ENABLED;
    if(vnd_dc_auto_freeze) st.flags |= VND_DC_CFG_FLAG_AUTO_FREEZE;
    if(vnd_dc_dirty_public) st.flags |= VND_DC_CFG_FLAG_DIRTY;
    st.work_settle_ms = vnd_dc_work_settle_ms;
    st.detect_settle_ms = vnd_dc_detect_settle_ms;
    st.fast_settle_ms = vnd_dc_fast_settle_ms;
    st.fast_duration_ms = vnd_dc_fast_duration_ms;
    st.active_settle_ms = active_settle_ms;
    st.mode_enter_ms = vnd_dc_mode_enter_ms;
    st.fast_until_ms = vnd_dc_fast_until_ms;
    st.adapt_updates = vnd_dc_adapt_updates;

    memcpy(dst, &st, sizeof(st));
    return (uint16_t)sizeof(st);
}

uint8_t vnd_is_streaming(void){ return streaming; }
uint8_t vnd_is_tx_enabled(void){ return vnd_tx_enable; }

static void vnd_apply_tx_enable_outputs(void)
{
    if(vnd_tx_enable){
        /* Разрешаем внешний передатчик; маркер фазы не должен зависеть от USB START/STOP. */
        HAL_GPIO_WritePin(GPIOA, GPIO_PIN_1, GPIO_PIN_RESET);
    } else {
        HAL_GPIO_WritePin(GPIOA, GPIO_PIN_1, GPIO_PIN_SET);
    }
    adc_stream_refresh_marker_output();
}

/* функция vnd_generate_test_sawtooth() реализована в vnd_testgen.c */

static void vnd_prepare_pair(void)
{
    uint32_t t_start = get_us_approx(); /* Начало измерения */

    dbg_prepare_calls++;
    /* ВАЖНО: полный режим (non-async) отправляет/закрывает пары по pair_send_idx.
       Чтобы не зависать, готовим пару именно в том слоте, который будет отправляться следующим.
       Иначе можно заполнить другой слот и затем бесконечно ждать READY в pair_send_idx. */
    uint8_t active_slot = pair_send_idx;
    if(vnd_stream_mode == VND_STREAM_MODE_LOSSLESS_ROI || vnd_stream_mode == VND_STREAM_MODE_AVG_ROI){
        /* В строгих режимах не готовим пары "вперёд" в других слотах.
           Иначе при оборачивании кольца можно накопить READY-кадры вне pair_send_idx
           и получить зависание/перестановку A/B. */
        if(g_frames[active_slot][0].st != FB_FILL || g_frames[active_slot][1].st != FB_FILL){
            return;
        }
    } else {
        for(uint8_t i=0;i<VND_PAIR_BUFFERS;i++){
            uint8_t s = (uint8_t)((pair_send_idx + i) % VND_PAIR_BUFFERS);
            if(g_frames[s][0].st == FB_FILL && g_frames[s][1].st == FB_FILL){ active_slot = s; break; }
        }
    }
    
