kslabs/BMI30.stm32h7/USB_DEVICE/App/usb_vendor_app.c
        case VND_CMD_TOGGLE_TIM2CH3_INV:
        {
            /* Переключаем полярность CH3 на лету (PA2 = TIM2_CH3). */
            uint32_t ccer = TIM2->CCER;
            ccer ^= TIM_CCER_CC3P;
            TIM2->CCER = ccer;
        }
        break;

        case VND_CMD_SET_TX_ENABLE:
        {
            if(len >= 2){
                uint8_t en = (data[1] != 0u) ? 1u : 0u;
                vnd_tx_enable = en;
                vnd_apply_tx_enable_outputs();
                cdc_logf("EVT TX_ENABLE=%u", (unsigned)en);
            }
        }
        break;

        case VND_CMD_SET_OPTIC_POWER:
        {
            if(len >= 2){
                uint8_t applied = optic_tx_set_power(data[1]);
                cdc_logf("EVT OPTIC_POWER=%u", (unsigned)applied);
            }
        }
        break;

        case VND_CMD_SET_OPTIC_HOLD:
        {
            if(len >= 3){
                uint16_t deciseconds = (uint16_t)(data[1] | (data[2] << 8));
                uint16_t applied = optic_sensor_set_hold_deciseconds(deciseconds);
                cdc_logf("EVT OPTIC_HOLD_DS=%u", (unsigned)applied);
            } else if(len >= 2){
                uint8_t applied = optic_sensor_set_hold_seconds(data[1]);
                cdc_logf("EVT OPTIC_HOLD_S_LEGACY=%u", (unsigned)applied);
            }
        }
        break;

        case VND_CMD_SET_LED_PATTERN:
        {
            if(len >= 2){
                uint8_t applied = dynamic_led_set_pattern(data[1]);
                cdc_logf("EVT LED_PATTERN=%u", (unsigned)applied);
            }
        }
        break;

        case VND_CMD_LED_EVENT:
        {
            if (len >= 4) {
                uint8_t event = data[1];
                uint16_t duration_ms = (uint16_t)(data[2] | (data[3] << 8));
                ws2812_event_t led_event = WS2812_EVENT_NONE;

                if (event == VND_LED_EVENT_CHANNEL_B) {
                    led_event = WS2812_EVENT_CHANNEL_B;
                } else if (event == VND_LED_EVENT_CHANNEL_A) {
                    led_event = WS2812_EVENT_CHANNEL_A;
                } else if (event == VND_LED_EVENT_BOTH) {
                    led_event = WS2812_EVENT_CHANNEL_BOTH;
                } else if (event == VND_LED_EVENT_SPLIT_IN) {
                    led_event = WS2812_EVENT_SPLIT_IN;
                } else if (event == VND_LED_EVENT_SPLIT_OUT) {
                    led_event = WS2812_EVENT_SPLIT_OUT;
                }

                if (duration_ms == 0u) {
                    duration_ms = 1600u;
                }

                ws2812_spi_trigger_event(led_event, duration_ms);
                cdc_logf("EVT LED_EVENT event=%u dur=%u", (unsigned)event, (unsigned)duration_ms);
            }
        }
        break;

        case VND_CMD_SET_WINDOWS:
            if(len >= 9)
            {
                /* 1 + 8 байт */
                win_start0 = (uint16_t)(data[1] | (data[2] << 8));
                win_len0   = (uint16_t)(data[3] | (data[4] << 8));
                win_start1 = (uint16_t)(data[5] | (data[6] << 8));
                win_len1   = (uint16_t)(data[7] | (data[8] << 8));
                win_auto = 0; /* ручное окно отключает авто-смещение */
                VND_LOG("SET_WINDOWS s0=%u l0=%u s1=%u l1=%u", win_start0, win_len0, win_start1, win_len1);
                /* При смене ROI сбросить накопители усреднения, чтобы не смешивать разные окна */
                vnd_avg_reset();
                vnd_update_lcd_params();
            }
            break;

        case VND_CMD_SET_STREAM_MODE:
            if(len >= 2)
            {
                uint8_t m = data[1];
                if(m > VND_STREAM_MODE_AVG_ROI) m = VND_STREAM_MODE_LATEST;
                vnd_stream_mode = m;

                if(vnd_stream_mode == VND_STREAM_MODE_AVG_ROI){
                    /* avg_n: опционально */
                    uint8_t n = (len >= 3) ? data[2] : 20;
                    if(n < 1) n = 1;
                    if(n > VND_AVG_MAX_N) n = VND_AVG_MAX_N;
                    vnd_avg_n = n;
                    vnd_avg_reset();

                    /* ВАЖНО: не делаем vnd_dc_load_once() здесь — этот обработчик может быть в USB IRQ.
                       Просим выполнить загрузку DC в main-loop (Vendor_Stream_Task) как можно раньше. */
                    vnd_dc_load_request = 1;
                }

                /* Печать в UART (COM4) — чтобы однозначно видеть применённый режим/avg_n */
                printf("[CMD_IND] SET_STREAM_MODE m=%u len=%u avg_n=%u\r\n", (unsigned)vnd_stream_mode, (unsigned)len, (unsigned)vnd_avg_n);

                /* LOSSLESS_ROI требует строгих A->B пар, поэтому принудительно выключаем async.
                   Это делает переключение режима самодостаточным (GUI не обязан слать SET_ASYNC_MODE). */
                if(vnd_stream_mode == VND_STREAM_MODE_LOSSLESS_ROI || vnd_stream_mode == VND_STREAM_MODE_AVG_ROI){
                    async_mode = 0;
                    async_mode_host_set = 1;
                }

                /* При смене режима сбрасываем lock размера кадра, чтобы избежать рассинхронизации формата. */
                cur_samples_per_frame = 0;
                cur_expected_frame_size = 0;

                /* Для требуемого режима "lossless ROI" выставляем дефолтное окно 200 семплов
                   со сдвигом по частоте (база 200 Гц -> старт 280).
                   Хост всё равно может переопределить через SET_WINDOWS.
                   Не перезаписываем ROI, если хост уже установил его (win_auto==0). */
                if(vnd_stream_mode == VND_STREAM_MODE_LOSSLESS_ROI || vnd_stream_mode == VND_STREAM_MODE_AVG_ROI){
                    if(win_auto != 0){
                        vnd_apply_auto_roi_window();
                    }
                }
                vnd_update_lcd_params();
            }
            break;

        case VND_CMD_SET_DC_ADAPT:
            /* Управление адаптацией DC: 0x00=заморозить, 0x01=включить
               При детекции сигнала на RPI можно заморозить обучение DC,
               оставив вычитание текущих значений. */
            if(len >= 2)
            {
                uint8_t enable = data[1];
                if(enable != 0u){
                    uint8_t resume = vnd_dc_resume_mode;
                    if(resume == VND_DC_MODE_FREEZE || resume > VND_DC_MODE_BOOT_FAST){
                        resume = VND_DC_MODE_WORK;
                    }
                    vnd_dc_set_mode(resume);
                } else {
                    uint8_t current = vnd_dc_effective_mode(HAL_GetTick());
                    if(current != VND_DC_MODE_FREEZE){
                        vnd_dc_resume_mode = current;
                    }
                    vnd_dc_set_mode(VND_DC_MODE_FREEZE);
                }
                printf("[CMD_IND] SET_DC_ADAPT %s\r\n", vnd_dc_adapt_enabled ? "ACTIVE" : "FREEZE");
                cdc_logf("EVT SET_DC_ADAPT %u mode=%u resume=%u",
                         (unsigned)vnd_dc_adapt_enabled,
                         (unsigned)vnd_dc_mode,
                         (unsigned)vnd_dc_resume_mode);
            }
            break;

        case VND_CMD_SET_DC_CONFIG:
            /* Time-based DC config:
               payload after opcode:
                 u8 version=1, u8 mode, u16 flags,
                 u32 work_settle_ms, detect_settle_ms, fast_settle_ms, fast_duration_ms. */
            if(len >= 3)
            {
                vnd_dc_apply_config_payload(&data[1], (uint32_t)(len - 1u));
                printf("[CMD_IND] SET_DC_CONFIG mode=%u work=%lums detect=%lums fast=%lums dur=%lums\r\n",
                       (unsigned)vnd_dc_mode,
                       (unsigned long)vnd_dc_work_settle_ms,
                       (unsigned long)vnd_dc_detect_settle_ms,
                       (unsigned long)vnd_dc_fast_settle_ms,
                       (unsigned long)vnd_dc_fast_duration_ms);
                cdc_logf("EVT SET_DC_CONFIG mode=%u work=%lu detect=%lu fast=%lu dur=%lu",
                         (unsigned)vnd_dc_mode,
                         (unsigned long)vnd_dc_work_settle_ms,
                         (unsigned long)vnd_dc_detect_settle_ms,
                         (unsigned long)vnd_dc_fast_settle_ms,
                         (unsigned long)vnd_dc_fast_duration_ms);
            }
            break;

        case VND_CMD_GET_DC_CONFIG:
            {
                uint8_t cfg[VND_DC_CONFIG_MAX];
                uint16_t l = vnd_build_dc_config(cfg, sizeof(cfg));
                if(l && !vnd_ep_busy && !vnd_inflight){
                    vnd_tx_ready = 0; vnd_ep_busy = 1; vnd_last_tx_len = l; vnd_last_tx_start_ms = HAL_GetTick();
                    if(USBD_VND_Transmit(&hUsbDeviceHS, cfg, l) == USBD_OK){
                        vnd_tx_meta_after(cfg, l);
                    } else {
                        vnd_tx_ready = 1; vnd_ep_busy = 0;
                    }
                }
            }
            break;
            
        case VND_CMD_CALIB_DC_FAST:
            /* Legacy: запустить быструю адаптацию DC на N кадров.
               Внутри переводим это во временный BOOT_FAST window. */
            if(len >= 2)
            {
                uint16_t frames = (uint16_t)data[1];
                uint8_t retrigger_ignored = 0u;
                uint32_t remaining_ms = 0u;
                if (len >= 3) frames |= ((uint16_t)data[2] << 8); // allow 16-bit
                
                if (frames > 1000) frames = 1000;

                if(frames == 0u){
                    vnd_dc_fast_frames = 0u;
                    vnd_dc_set_mode(VND_DC_MODE_WORK);
                } else {
                    uint32_t rate = vnd_dc_legacy_fast_rate_hz();
                    uint32_t duration_ms = ((uint32_t)frames * 1000u) / rate;
                    uint32_t now_ms = HAL_GetTick();
                    if(duration_ms < 1000u) duration_ms = 1000u;
                    vnd_dc_fast_duration_ms = vnd_dc_clamp_fast_duration_ms(duration_ms);
                    if(vnd_dc_mode == VND_DC_MODE_BOOT_FAST && vnd_dc_fast_frames == frames){
                        int32_t delta_ms = (int32_t)(vnd_dc_fast_until_ms - now_ms);
                        if(delta_ms > 0){
                            retrigger_ignored = 1u;
                            remaining_ms = (uint32_t)delta_ms;
                        }
                    }

